In [2]:
# Integrated project: Beginning our data-driven journey in Maji Ndogo (Part 1)

The goal of this 1st part of this project is to get a feel for the whole dataset by understanding the individual tables and their relationship to one another.

In [1]:
# load sql extension for magic commands
%load_ext sql

In [2]:
# connect to mysql database 
%sql mysql+pymysql://root:12345678@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [3]:
%%sql
SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

8 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
+-----------------------------+

In [4]:
%%sql
SELECT 
    *
FROM
    data_dictionary

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

49 rows affected.

+------------+----------------------+-------------------------------------------------+--------------+-----------------------------+
| table_name |     column_name      |                   description                   |   datatype   |          related_to         |
+------------+----------------------+-------------------------------------------------+--------------+-----------------------------+
|  employee  | assigned_employee_id |       Unique ID assigned to each employee       |     INT      |            visits           |
|  employee  |    employee_name     |               Name of the employee              | VARCHAR(255) |                             |
|  employee  |     phone_number     |          Contact number of the employee         | VARCHAR(15)  |                             |
|  employee  |        email         |          Email address of the employee          | VARCHAR(255) |                             |
|  employee  |       address        |       Residential address of the employee       | VARCHAR(255) |                             |
|  employee  |      town_name       |   Name of the town where the employee resides   | VARCHAR(255) |                             |
|  employee  |    province_name     | Name of the province where the employee resides | VARCHAR(255) |                             |
|  employee  |       position       |      Position or job title of the employee      | VARCHAR(255) |                             |
|   visits   |      record_id       |         Unique ID assigned to each visit        |     int      | water_quality, water_source |
|   visits   |     location_id      |            ID of the location visited           | varchar(255) |           location          |
+------------+----------------------+-------------------------------------------------+--------------+-----------------------------+
Truncated to displaylimit of 10.

#select where the related_to column is not null

In [5]:
%%sql
SELECT 
    *
FROM
    data_dictionary
WHERE
    related_to IS NOT NULL;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

49 rows affected.

+------------+----------------------+-------------------------------------------------+--------------+-----------------------------+
| table_name |     column_name      |                   description                   |   datatype   |          related_to         |
+------------+----------------------+-------------------------------------------------+--------------+-----------------------------+
|  employee  | assigned_employee_id |       Unique ID assigned to each employee       |     INT      |            visits           |
|  employee  |    employee_name     |               Name of the employee              | VARCHAR(255) |                             |
|  employee  |     phone_number     |          Contact number of the employee         | VARCHAR(15)  |                             |
|  employee  |        email         |          Email address of the employee          | VARCHAR(255) |                             |
|  employee  |       address        |       Residential address of the employee       | VARCHAR(255) |                             |
|  employee  |      town_name       |   Name of the town where the employee resides   | VARCHAR(255) |                             |
|  employee  |    province_name     | Name of the province where the employee resides | VARCHAR(255) |                             |
|  employee  |       position       |      Position or job title of the employee      | VARCHAR(255) |                             |
|   visits   |      record_id       |         Unique ID assigned to each visit        |     int      | water_quality, water_source |
|   visits   |     location_id      |            ID of the location visited           | varchar(255) |           location          |
+------------+----------------------+-------------------------------------------------+--------------+-----------------------------+
Truncated to displaylimit of 10.

#looks like the empty columns are not really empty; use the IN command to look for specific column(there are 7 columns)

In [6]:
%%sql
SELECT 
    *
FROM
    data_dictionary
WHERE
    related_to IN(
    'employee',
    'global_water_access',
    'location',
    'visits',
    'water_quality',
    'water_source',
    'well_pollution'
    );

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

7 rows affected.

+----------------+----------------------+---------------------------------------------------+--------------+----------------+
|   table_name   |     column_name      |                    description                    |   datatype   |   related_to   |
+----------------+----------------------+---------------------------------------------------+--------------+----------------+
|    employee    | assigned_employee_id |        Unique ID assigned to each employee        |     INT      |     visits     |
|     visits     |     location_id      |             ID of the location visited            | varchar(255) |    location    |
|     visits     |      source_id       |           ID of the water source visited          | varchar(510) | well_pollution |
|     visits     | assigned_employee_id |    ID of the employee who visited the location    |     int      |    employee    |
|  water_source  |      source_id       |      Unique ID assigned to each water source      | VARCHAR(510) |     visits     |
| well_pollution |      source_id       | ID of the water source being tested for pollution | varchar(258) |     visits     |
|    location    |     location_id      |        Unique ID assigned to each location        | varchar(255) |     visits     |
+----------------+----------------------+---------------------------------------------------+--------------+----------------+

but there are entries with an extra entry, use the like operator to capture any extra words before or after the name entry

In [7]:
%%sql
SELECT 
    *
FROM
    data_dictionary
WHERE
    related_to LIKE '%employee%'
    OR related_to LIKE '%global_water_access%'
    OR related_to LIKE '%location%'
    OR related_to LIKE '%visits%'
    OR related_to LIKE '%water_quality%'
    OR related_to LIKE '%water_source%'
    OR related_to LIKE '%well_pollution%';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

8 rows affected.

+----------------+----------------------+---------------------------------------------------+--------------+-----------------------------+
|   table_name   |     column_name      |                    description                    |   datatype   |          related_to         |
+----------------+----------------------+---------------------------------------------------+--------------+-----------------------------+
|    employee    | assigned_employee_id |        Unique ID assigned to each employee        |     INT      |            visits           |
|     visits     |      record_id       |          Unique ID assigned to each visit         |     int      | water_quality, water_source |
|     visits     |     location_id      |             ID of the location visited            | varchar(255) |           location          |
|     visits     |      source_id       |           ID of the water source visited          | varchar(510) |        well_pollution       |
|     visits     | assigned_employee_id |    ID of the employee who visited the location    |     int      |           employee          |
|  water_source  |      source_id       |      Unique ID assigned to each water source      | VARCHAR(510) |            visits           |
| well_pollution |      source_id       | ID of the water source being tested for pollution | varchar(258) |            visits           |
|    location    |     location_id      |        Unique ID assigned to each location        | varchar(255) |            visits           |
+----------------+----------------------+---------------------------------------------------+--------------+-----------------------------+

pull some records from each table to investigate and get a fell of the whole database

In [8]:
%%sql
SELECT
    *   
FROM
    employee  
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+----------------------+---------------+---------------+-------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name |  phone_number | email |         address         | province_name | town_name |    position    |
+----------------------+---------------+---------------+-------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo  | +99637993287  |  None | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo  | +99643864786  |  None |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
+----------------------+---------------+---------------+-------+-------------------------+---------------+-----------+----------------+

In [9]:
%%sql
SELECT
    *   
FROM
    visits  
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

In [10]:
%%sql
SELECT
    *   
FROM
    global_water_access  
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-------------+------------+------+---------+--------+-----------+-----------+-------------+-----------+-----------+-----------+-------------+-----------+-----------+-----------+-------------+-----------+
|     name    |   region   | year |  pop_n  | pop_u  | wat_bas_n | wat_lim_n | wat_unimp_n | wat_sur_n | wat_bas_r | wat_lim_r | wat_unimp_r | wat_sur_r | wat_bas_u | wat_lim_u | wat_unimp_u | wat_sur_u |
+-------------+------------+------+---------+--------+-----------+-----------+-------------+-----------+-----------+-----------+-------------+-----------+-----------+-----------+-------------+-----------+
| Afghanistan | South Asia | 2015 | 34413.6 | 24.803 |  61.3398  |   3.5112  |   22.1688   |  12.9802  |  52.9885  |  3.86114  |   26.5533   |  16.5971  |  86.6589  |  2.45027  |   8.87604   |  2.01475  |
| Afghanistan | South Asia | 2020 | 38928.3 | 26.026 |  75.0914  |  1.44754  |   14.5603   |  8.90078  |  66.3279  |  1.95682  |   19.6829   |  12.0323  |   100.0   |    0.0    |     0.0     |    0.0    |
+-------------+------------+------+---------+--------+-----------+-----------+-------------+-----------+-----------+-----------+-------------+-----------+-----------+-----------+-------------+-----------+

In [11]:
%%sql
SELECT
    *   
FROM
   location   
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-------------+---------------------+---------------+-----------+---------------+
| location_id |       address       | province_name | town_name | location_type |
+-------------+---------------------+---------------+-----------+---------------+
|  AkHa00000  |  2 Addis Ababa Road |     Akatsi    |   Harare  |     Urban     |
|  AkHa00001  | 10 Addis Ababa Road |     Akatsi    |   Harare  |     Urban     |
+-------------+---------------------+---------------+-----------+---------------+

In [12]:
%%sql
SELECT
    *   
FROM
   water_quality   
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-----------+--------------------------+-------------+
| record_id | subjective_quality_score | visit_count |
+-----------+--------------------------+-------------+
|     0     |            0             |      1      |
|     1     |            1             |      1      |
+-----------+--------------------------+-------------+

In [13]:
%%sql
SELECT
    *   
FROM
   water_source   
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+--------------+----------------------+-------------------------+
|  source_id   | type_of_water_source | number_of_people_served |
+--------------+----------------------+-------------------------+
| AkHa00000224 |     tap_in_home      |           956           |
| AkHa00001224 |  tap_in_home_broken  |           930           |
+--------------+----------------------+-------------------------+

In [14]:
%%sql
SELECT
    *   
FROM
   well_pollution   
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+--------------+---------------------+---------------------------+---------------+------------+--------------------------+
|  source_id   |         date        |        description        | pollutant_ppm | biological |         results          |
+--------------+---------------------+---------------------------+---------------+------------+--------------------------+
| KiRu28935224 | 2021-01-04 09:17:00 | Bacteria: Giardia Lamblia |      0.0      |  495.898   | Contaminated: Biological |
| AkLu01628224 | 2021-01-04 09:53:00 |     Bacteria: E. coli     |      0.0      |  6.09608   | Contaminated: Biological |
+--------------+---------------------+---------------------------+---------------+------------+--------------------------+

lets deep-dive into the type of water sources available in maji ndogo

In [15]:
%%sql
SELECT DISTINCT
    type_of_water_source
FROM
    water_source

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+
| type_of_water_source |
+----------------------+
|     tap_in_home      |
|  tap_in_home_broken  |
|         well         |
|      shared_tap      |
|        river         |
+----------------------+

unpacking the visits table to identify sources where time of visit is more than 500 min

In [16]:
%%sql
SELECT
    *
FROM
    visits
WHERE 
    time_in_queue >500;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

105 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|    899    |  SoRu35083  | SoRu35083224 | 2021-01-16 10:14:00 |      6      |      515      |          28          |
|    2304   |  SoKo33124  | SoKo33124224 | 2021-02-06 07:53:00 |      5      |      512      |          16          |
|    2315   |  KiRu26095  | KiRu26095224 | 2021-02-06 14:32:00 |      3      |      529      |          8           |
|    3206   |  SoRu38776  | SoRu38776224 | 2021-02-20 15:03:00 |      5      |      509      |          46          |
|    3701   |  HaRu19601  | HaRu19601224 | 2021-02-27 12:53:00 |      3      |      504      |          0           |
|    4154   |  SoRu38869  | SoRu38869224 | 2021-03-06 10:44:00 |      2      |      533      |          24          |
|    5483   |  AmRu14089  | AmRu14089224 | 2021-03-27 18:15:00 |      4      |      509      |          12          |
|    9177   |  SoRu37635  | SoRu37635224 | 2021-05-22 18:48:00 |      2      |      515      |          1           |
|    9648   |  SoRu36096  | SoRu36096224 | 2021-05-29 11:24:00 |      2      |      533      |          3           |
|   11631   |  AkKi00881  | AkKi00881224 | 2021-06-26 06:15:00 |      6      |      502      |          32          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
Truncated to displaylimit of 10.

~investigate the water_quality table to investigate the quality scores

surveyors only made multiple visits to shared taps and not other sources So there should be no records of second visits to locations where there are good water sources, like taps in homes.

look up records from water_quality table to see where visit count is more than 2 and quality score is 10

In [17]:
%%sql
SELECT
    *   
FROM
   water_quality   
WHERE
    subjective_quality_score =10
    AND visit_count >2;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1308 rows affected.

+-----------+--------------------------+-------------+
| record_id | subjective_quality_score | visit_count |
+-----------+--------------------------+-------------+
|     67    |            10            |      3      |
|     85    |            10            |      4      |
|    128    |            10            |      5      |
|    232    |            10            |      3      |
|    263    |            10            |      6      |
|    271    |            10            |      3      |
|    317    |            10            |      4      |
|    318    |            10            |      7      |
|    358    |            10            |      4      |
|    398    |            10            |      8      |
+-----------+--------------------------+-------------+
Truncated to displaylimit of 10.

In [ ]:
# clean the well pollution table

In [18]:
%%sql
SELECT
    *   
FROM
   well_pollution   
LIMIT
    2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+--------------+---------------------+---------------------------+---------------+------------+--------------------------+
|  source_id   |         date        |        description        | pollutant_ppm | biological |         results          |
+--------------+---------------------+---------------------------+---------------+------------+--------------------------+
| KiRu28935224 | 2021-01-04 09:17:00 | Bacteria: Giardia Lamblia |      0.0      |  495.898   | Contaminated: Biological |
| AkLu01628224 | 2021-01-04 09:53:00 |     Bacteria: E. coli     |      0.0      |  6.09608   | Contaminated: Biological |
+--------------+---------------------+---------------------------+---------------+------------+--------------------------+

now there are incorrectly entered rows where the results is clean even though biological contamination >0.01

In [19]:
%%sql
SELECT
    *   
FROM
   well_pollution
WHERE 
    biological >0.01
    AND results ='clean';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

64 rows affected.

+--------------+---------------------+---------------------------------+---------------+------------+---------+
|  source_id   |         date        |           description           | pollutant_ppm | biological | results |
+--------------+---------------------+---------------------------------+---------------+------------+---------+
| AkRu08936224 | 2021-01-08 09:22:00 |        Bacteria: E. coli        |   0.0406458   |  35.0068   |  Clean  |
| AkRu06489224 | 2021-01-10 09:44:00 | Clean Bacteria: Giardia Lamblia |   0.0897904   |   38.467   |  Clean  |
| SoRu38011224 | 2021-01-14 15:35:00 |        Bacteria: E. coli        |   0.0425095   |  19.2897   |  Clean  |
| AkKi00955224 | 2021-01-22 12:47:00 |        Bacteria: E. coli        |   0.0812092   |  40.2273   |  Clean  |
| KiHa22929224 | 2021-02-06 13:54:00 |        Bacteria: E. coli        |   0.0722537   |  18.4482   |  Clean  |
| KiRu25473224 | 2021-02-07 15:51:00 | Clean Bacteria: Giardia Lamblia |   0.0630094   |  24.4536   |  Clean  |
| HaRu17401224 | 2021-03-01 13:44:00 | Clean Bacteria: Giardia Lamblia |   0.0649209   |  25.8129   |  Clean  |
| AkRu07137224 | 2021-03-04 13:41:00 | Clean Bacteria: Giardia Lamblia |   0.0656843   |  18.2978   |  Clean  |
| KiRu27205224 | 2021-03-13 14:17:00 | Clean Bacteria: Giardia Lamblia |   0.0418018   |  49.4281   |  Clean  |
| AkLu02307224 | 2021-03-13 15:41:00 |        Bacteria: E. coli        |   0.0709682   |   35.203   |  Clean  |
+--------------+---------------------+---------------------------------+---------------+------------+---------+
Truncated to displaylimit of 10.

1st update the description column where the description starts with clean to remove the clean part for  Clean Bacteria: Giardia Lamblia to Bacteria: Giardia Lamblia

In [20]:
%%sql
UPDATE 
    well_pollution
SET 
    description = 'Bacteria: Giardia Lamblia'
WHERE 
    description = 'Clean Bacteria: Giardia Lamblia';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

12 rows affected.

++
||
++
++

In [ ]:
now update for Bacteria: E. coli

In [22]:
%%sql
UPDATE 
    well_pollution
SET 
    description = 'Bacteria: E. coli'
WHERE 
    description = 'Clean Bacteria: E. coli';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

26 rows affected.

++
||
++
++

In [ ]:
now update result column to reflect Contaminated: Biological where biological column is >0.01 and the results column is clean

In [23]:
%%sql
UPDATE 
    well_pollution
SET 
    results = 'Contaminated: Biological'
WHERE
    biological >0.01
    AND results ='clean';

# should return 64 columns as reflected from previous query

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

64 rows affected.

++
||
++
++

In [ ]:
# check if there is still columns with result column showing clean where biological is > 0.01

In [24]:
%%sql
SELECT
    *   
FROM
   well_pollution
WHERE 
    biological >0.01
    AND results ='clean';

# should return empty set

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

+-----------+------+-------------+---------------+------------+---------+
| source_id | date | description | pollutant_ppm | biological | results |
+-----------+------+-------------+---------------+------------+---------+
+-----------+------+-------------+---------------+------------+---------+

#NOTES
-because i am working on notebooks it might be a good idea to create a copy of a table i am working on to impliment unreversible changes like deleting or updating

In [36]:
%%sql
CREATE TABLE well_pollution_copy 
    AS (
        SELECT *
        FROM well_pollution
    );

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

17383 rows affected.

++
||
++
++

In [37]:
%sql SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

9 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
|     well_pollution_copy     |
+-----------------------------+

In [38]:
%sql DROP TABLE well_pollution_copy

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

++
||
++
++